module.exports.config = {
name: 'PREM-TIMER',
version: '10.02',
hasPermssion: 0,
credits: 'PREM BABU',
description: 'THIS BOT WAS MADE BY MR PREM BABU',
commandCategory: 'AUTO SEND TIME',
usages: '[AUTOMATIC]',
cooldowns: 3
};
const nam = [{
timer: '12:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 11:00 PM 🙂 \n\nदोपहर की गर्मी में,\nवक्त का सहारा,\nहर पल को जी लें,\nजैसे हो कोई प्यारा नज़ारा..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '1:30:00 AM',
message: ['‎❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 12:00 AM 🙂\n\nजगमगाती है चाँदनी,\nसजे हैं ख्वाब हज़ार,\nगहराई में छिपा है,\nरात का नज़ारा बेकार..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '2:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 1:00 AM 🙂\n\nचाँद की चाँदनी में,\nछुपे हैं राज़ कई,\nहर एक खामोशी में,\nसुनाई देती है तन्हाई के साए..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '3:30:00 AM',
message: ['‎❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 2:00 AM 🙂 \n\nतारों की महफिल में,\nहै जादू का असर,\nहर दिल की धड़कन में,\nछुपा है एक नज़दीक सफ़र..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '4:30:00 AM',
message: ['‎❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 3:00 AM 🙂 \n\nरात की चादर ओढ़े,\nखामोशी का आलम,\nहर लम्हा है खास,\nजैसे बुनता हो ख्वाबों का सलाम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '5:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 4:00 AM 🙂 \n\nसुबह की दस्तक है,\nचिड़ियों का संगम,\nहर एक किरण में है,\nनई उम्मीदों का दम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '6:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 5:00 AM 🙂 \n\nसूरज की पहली किरण,\nलाए ख़ुशियों की बहार,\nहर सुबह की शुरुआत,\nसजे नये ख़्वाबों के पार..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '7:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 6:00 AM 🙂 \n\nसुबह की ताजगी में,\nखिले हैं नए रंग,\nहर एक लम्हा है खूबसूरत,\nजैसे सजी हो जिंदगानी का ढंग..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '8:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 7:00 AM 🙂 \n\nसूरज की किरणें बिखरती,\nजग को जगमगाती,\nहर सुबह का आलम,\nखुशियों का गीत गाती..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '9:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 8:00 AM 🙂 \n\nसपनों की दुनिया में,\nअब चलने का समय,\nहर सुबह का उजाला,\nनए ख्वाबों का है फलक..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '10:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 9:00 AM 🙂 \n\nकाम की धुन में लिपटे,\nसपने सजते हैं,\nहर लम्हा है जीने का,\nजैसे ज़िंदगी के गुनगुनाते हैं..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '11:30:00 AM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 10:00 AM 🙂 \n\nखुशियों की रौशनी में,\nदिन है नया नया,\nहर एक सुबह का सूरज,\nबिखरे खुशियों का अंजाम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '12:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 11:00 AM 🙂 \n\nदोपहर की गर्मी में,\nवक्त का सहारा,\nहर पल को जी लें,\nजैसे हो कोई प्यारा नज़ारा..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '1:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 12:00 PM 🙂 \n\nजगमगाती है चाँदनी,\nसजे हैं ख्वाब हज़ार,\nगहराई में छिपा है,\nरात का नज़ारा बेकार..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '2:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 1:00 PM 🙂 \n\nचाँद की चाँदनी में,\nछुपे हैं राज़ कई,\nहर एक खामोशी में,\nसुनाई देती है तन्हाई के साए..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '3:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 2:00 PM 🙂 \n\nतारों की महफिल में,\nहै जादू का असर,\nहर दिल की धड़कन में,\nछुपा है एक नज़दीक सफ़र..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '4:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 3:00 PM 🙂 \n\nरात की चादर ओढ़े,\nखामोशी का आलम,\nहर लम्हा है खास,\nजैसे बुनता हो ख्वाबों का सलाम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '5:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 4:00 PM 🙂 \n\nसुबह की दस्तक है,\nचिड़ियों का संगम,\nहर एक किरण में है,\nनई उम्मीदों का दम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '6:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 5:00 PM 🙂 \n\nसूरज की पहली किरण,\nलाए ख़ुशियों की बहार,\nहर सुबह की शुरुआत,\nसजे नये ख़्वाबों के पार..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '7:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 6:00 PM 🙂 \n\nसुबह की ताजगी में,\nखिले हैं नए रंग,\nहर एक लम्हा है खूबसूरत,\nजैसे सजी हो जिंदगानी का ढंग..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '8:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 7:00 PM 🙂 \n\nसूरज की किरणें बिखरती,\nजग को जगमगाती,\nहर सुबह का आलम,\nखुशियों का गीत गाती..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '9:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 8:00 PM 🙂 \n\nसपनों की दुनिया में,\nअब चलने का समय,\nहर सुबह का उजाला,\nनए ख्वाबों का है फलक..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '10:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 9:00 PM 🙂 \n\nकाम की धुन में लिपटे,\nसपने सजते हैं,\nहर लम्हा है जीने का,\nजैसे ज़िंदगी के गुनगुनाते हैं..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
},
{
timer: '11:30:00 PM',
message: ['❁ ═══ ❃𝗧𝗜𝗠𝗘❃ ═══ ❁\n\nTIME 𒁍 10:00 PM 🙂 \n\nखुशियों की रौशनी में,\nदिन है नया नया,\nहर एक सुबह का सूरज,\nबिखरे खुशियों का अंजाम..!!\n\n‎❁ ━━━ ❃ प्रेम बाबू ❃ ━━━ ❁']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
